Vapi27/gottfa-esp32/src/arena_net.cpp
#include <WiFi.h>
#include <esp_netif.h>
#include <esp_wifi.h>
#include <LittleFS.h>
#include "web_page.h"
#include <ESPmDNS.h>
#include <ESPAsyncWebServer.h>
#include <Preferences.h>
#include <Adafruit_NeoPixel.h>   // le pixel de statut, meme bibliotheque que la chaine
#include <esp_ota_ops.h>   // validation de l'image apres une OTA

// esp_read_mac : dans esp_mac.h depuis IDF 5, dans esp_system.h avant.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_mac.h>
#else
#include <esp_system.h>
#endif
#include <Update.h>
#include <esp_ota_ops.h>
#include <esp_partition.h>   // ecriture directe de la partition fichiers
#include <esp_flash.h>       // taille physique de la puce, via son identifiant JEDEC
// Empreinte de build exposee dans /api/state. L'en-tete a demenage entre les
// versions de l'IDF : esp_app_desc.h n'existe qu'a partir de la 5, alors que le
// build Arduino/PlatformIO tourne encore sur la 4.4. Meme structure, deux noms.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include <esp_app_desc.h>
#define ARENA_APP_DESC() esp_app_get_description()
#else
#include <esp_ota_ops.h>
#define ARENA_APP_DESC() esp_ota_get_app_description()
#endif

#ifdef ARENA_MATTER
// Definies dans arena_matter.cpp : ce fichier n'inclut aucun en-tete Matter.
extern "C" uint8_t arena_matter_fabrics();
extern "C" void    arena_matter_forget();
extern "C" const char* arena_matter_last_event();
extern "C" void arena_matter_event_log(char* out, size_t n);
#endif   // OTA en mode pull (voir pullOta plus bas)
#include "arena_config.h"
#include "arena_net.h"
#include "arenaled.h"
#include "arena_map.h"
#include "arena_pf.h"
#include "arena_attract.h"
#include "arena_oled.h"
#include "arena_peers.h"

namespace arenanet {

static AsyncWebServer s_server(80);
static Preferences    s_prefs;

// Un redemarrage demande par HTTP ne doit PAS partir depuis le gestionnaire :
// la reponse n'est pas encore sur le fil, et l'appelant ne verrait qu'une
// connexion coupee - impossible de distinguer "c'est fait" de "ca a plante".
static uint32_t       s_rebootAt = 0;

// Retour arriere automatique : la MOITIE manquante.
//
// CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE fait demarrer toute image fraichement
// installee a l'essai. Si personne ne la declare saine, le prochain demarrage
// repart sur l'ANCIENNE - ce qui est exactement le filet qu'on veut... et ce
// qui annulerait CHAQUE mise a jour si cet appel manquait. Les deux moities
// vont ensemble, il n'y a pas de demi-mesure possible.
//
// On ne valide pas au demarrage : une image qui plante trois secondes apres
// avoir demarre serait declaree bonne avant de tomber. On attend d'avoir une
// adresse ET une minute de fonctionnement, ce qui couvre le seul mode de panne
// que le retour arriere sait reparer - une image qui ne tient pas debout.
static bool s_imgValidated = false;

static void validateImageWhenHealthy() {
  if (s_imgValidated) return;
  if (millis() < 60000) return;
  const char* ip = arenanet::ip();
  if (!ip || !strcmp(ip, "0.0.0.0")) return;

  esp_ota_img_states_t st;
  const esp_partition_t* run = esp_ota_get_running_partition();
  if (esp_ota_get_state_partition(run, &st) == ESP_OK && st == ESP_OTA_IMG_PENDING_VERIFY) {
    if (esp_ota_mark_app_valid_cancel_rollback() == ESP_OK)
      Serial.println("[ota] image declaree saine - plus de retour arriere");
    else
      Serial.println("[ota] ECHEC de la validation - la carte reviendra a l'ancienne image");
  }
  s_imgValidated = true;
}

// Identite de la carte. La MAC est gravee en usine, donc unique sans reglage ni
// numero de serie a gerer : deux murs sortis de la meme image ne peuvent pas se
// confondre. Le proprietaire peut ensuite mettre "Volcano" ou "Arena".
static String         s_name;
static String         s_mac;

const String& wallName() { return s_name; }

// Un nom d'hote mDNS n'accepte ni espace ni accent ni majuscule.
static String hostify(const String& in) {
  String o;
  for (size_t i = 0; i < in.length(); i++) {
    char c = in[i];
    if (c >= 'A' && c <= 'Z') c += 32;
    if ((c >= 'a' && c <= 'z') || (c >= '0' && c <= '9')) o += c;
    else if (o.length() && o[o.length()-1] != '-')       o += '-';
  }
  while (o.length() && o[o.length()-1] == '-') o.remove(o.length()-1);
  return o.length() ? o : String("playfield");
}
static String         s_ip   = "0.0.0.0";
static String         s_mode = "init";

const char* ip()   { return s_ip.c_str(); }



const char* mode() { return s_mode.c_str(); }

// Served when LittleFS is empty (nobody ran `pio run -e arenaled -t uploadfs` yet):
// enough UI to prove the chain lights up and to reach the mode buttons.
static const char FALLBACK[] PROGMEM =
  "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
  "<title>Pinball Playfield Wall</title><style>body{background:#111;color:#eee;font:16px system-ui;padding:2em}"
  "a{display:inline-block;margin:.3em;padding:.6em 1em;background:#c60;color:#fff;"
  "text-decoration:none;border-radius:6px}</style><h1>Arena LED</h1>"
  "<p>Web UI not uploaded yet — run <code>pio run -e arenaled -t uploadfs</code>.</p>"
  "<p><a href='/api/set?mode=classic'>classic</a><a href='/api/set?mode=attract'>attract</a>"
  "<a href='/api/set?mode=arena'>arena</a><a href='/api/set?mode=night'>night</a>"
  "<a href='/api/set?mode=rainbow'>rainbow</a><a href='/api/set?mode=test'>test</a>"
  "<a href='/api/set?mode=off'>off</a></p><p><a href='/api/state'>/api/state</a></p>";

// Compteurs exportes par libs/Adafruit_NeoPixel/esp.c : ils disent si la sortie
// RMT part vraiment, ou si rmtInit() echoue (carte hors USB, donc pas de log).
extern "C" {
  extern volatile uint32_t espShowRmtFail, espShowFrames, espShowLockMiss;
  extern volatile uint32_t espShowInstalls, espShowNoIram;
  extern volatile int32_t  espShowBusType;
}

// --- OTA en mode "pull" ----------------------------------------------------
// Le POST /update pousse l'image depuis le callback AsyncTCP. Sur S3 ca tue la
// carte : Update.begin() efface la partition, ce qui bloque la tache AsyncTCP
// plusieurs secondes pendant que le client continue d'envoyer - lwIP manque de
// tampons et le chip tombe. Mesure du 2026-08-02 : 250 ko recus sur 1,6 Mo, puis
// un redemarrage qui ressemble a s'y meprendre a une mise a jour reussie.
//
// Ici c'est la carte qui va chercher l'image : elle lit au rythme qu'elle veut,
// donc rien ne s'accumule, et l'effacement se fait pendant que personne ne
// pousse. On passe aussi la taille reelle a esp_ota_begin() au lieu de
// OTA_SIZE_UNKNOWN, qui effacait les 3 Mo entiers de la partition.
static String        s_pullUrl;
static volatile bool s_pullPending = false;
static String        s_pullStatus  = "idle";
static uint32_t      s_pullDone = 0, s_pullTotal = 0;
static bool          s_pullFs = false;   // application ou systeme de fichiers

