Vapi27/gottfa-esp32/src/arena_net.cpp
// Balayage WiFi. Lance depuis la boucle principale, jamais depuis un handler :
// WiFi.scanNetworks() bloque 2 a 5 s, et bloquer la tache AsyncTCP est
// exactement ce qui tuait la carte pendant les mises a jour.
// Pourquoi la derniere tentative d'association a echoue. Sans ca, un mot de
// passe faux, un reseau absent et un reseau en 5 GHz donnent tous le meme
// resultat visible : la carte repart en point d'acces, sans un mot.
static String        s_staReason  = "";

static volatile bool s_scanWanted = false;
static String        s_scanJson   = "[]";
// Pourquoi un balayage n'a rien rendu. Une liste vide est ambigue - refus du
// pilote, ou vraiment aucun reseau - et les deux se soignent differemment.
static String        s_scanErr    = "";

// Un ecran noir et une carte qui redemarre se ressemblent de l'exterieur. La
// difference se lit ici : le compteur monte a chaque demarrage, et la cause du
// dernier reset dit si c'etait une coupure, un plantage ou un chien de garde.
static uint8_t       s_statPin    = ARENA_STATUS_PIN;

// Le pixel de statut et la chaine du mur se partagent le peripherique RMT, et
// le conflit vient de la CADENCE, pas de la bibliotheque.
//
// L'histoire, parce qu'elle a coute trois tours : neopixelWrite() re-reclame un
// canal RMT a chaque appel, et a 25 Hz - la respiration de ce temoin - il
// rendait la chaine muette ("RMT DRIVER ERR" a 25 Hz, exactement). J'ai d'abord
// eteint le temoin, ce qui reglait le conflit en supprimant l'un des deux ; puis
// je l'ai passe a Adafruit_NeoPixel, et il est sorti BLANC A FOND.
//
// Les timings de la branche heritee d'Adafruit sont ceux du WS2812 (T1H 800 ns);
// un SK6812 attend 600 ns et lit alors des uns partout - du blanc plein, a
// pleine echelle, insensible a la luminosite qu'on lui demande. neopixelWrite()
// rendait les bonnes couleurs sur CETTE carte : c'est un fait mesure, et il
// repasse devant mon raisonnement.
//
// On revient donc a neopixelWrite(), et on retire ce qui obligeait au 25 Hz : la
// respiration. Le temoin est fixe, et n'est reecrit que lorsque sa couleur
// change - plus un rafraichissement lent de securite.
static bool          s_statOn     = true;
// Luminosite du temoin, 0..255. Elle etait ecrite en dur, et un temoin en dur
// est un temoin qui eblouit quelqu'un : la meme LED sert de veilleuse a cote
// d'un lit et de repere en plein jour. 60 par defaut - visible sans agresser.
static uint8_t       s_statBright = 60;
static String        s_reset      = "?";
static uint32_t      s_boots      = 0;

// Un brownout ne laisse aucune trace apres le redemarrage suivant : la cause du
// reset ne parle que du DERNIER. Ce compteur-la, lui, tient le total, et c est
// lui qui distingue "une fois, en debranchant" de "a chaque rafale WiFi".
static uint32_t      s_brownouts  = 0;
static uint8_t       s_txq        = ARENA_WIFI_TXPWR_QDBM;   // quarts de dBm
static bool          s_txDerated  = false;   // baissee d office apres un brownout

// A appeler seulement quand la radio tourne (esp_wifi_start est passe) : sinon
// l IDF repond ESP_ERR_WIFI_NOT_STARTED et la valeur est perdue en silence.
static void applyTxPower() {
  const esp_err_t e = esp_wifi_set_max_tx_power((int8_t)s_txq);
  if (e != ESP_OK) {
    Serial.printf("[net] puissance TX refusee (%d)\n", (int)e);
    return;
  }
  Serial.printf("[net] puissance TX = %.2f dBm%s\n", s_txq / 4.0f,
                s_txDerated ? "  (baissee apres un brownout)" : "");
}

// La taille de flash annoncee par ESP.getFlashChipSize() vient de l en-tete que
// l outil de flashage a ecrit : elle repete ce que le build a SUPPOSE, pas ce que
// la puce porte. L identifiant JEDEC, lui, vient du silicium - octet 3 = capacite
// en puissance de deux. C est la seule source qui puisse contredire le build.
static uint32_t physicalFlashBytes() {
  uint32_t id = 0;
  if (esp_flash_read_id(esp_flash_default_chip, &id) != ESP_OK) return 0;
  const uint8_t cap = (uint8_t)(id & 0xFF);
  if (cap < 0x14 || cap > 0x1A) return 0;      // hors 1 Mo..64 Mo : code inconnu
  return 1UL << cap;
}

// Fin de la derniere partition de la table. Si elle depasse la flash reelle, les
// partitions du haut - OTA et fichiers, justement - pointent dans le vide : une
// OTA s ecrit par-dessus elle-meme et LittleFS se corrompt au premier montage.
// Rien de tout cela ne se voit au demarrage, ce qui est exactement le probleme.
static uint32_t partitionEndBytes() {
  uint32_t end = 0;
  esp_partition_iterator_t it =
      esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, nullptr);
  while (it) {
    const esp_partition_t* p = esp_partition_get(it);
    if (p && p->address + p->size > end) end = p->address + p->size;
    it = esp_partition_next(it);
  }
  esp_partition_iterator_release(it);
  return end;
}

static uint32_t s_flashPhys = 0;
static uint32_t s_partEnd   = 0;
static bool     s_flashBad  = false;

static const char* resetReasonName(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "mise sous tension";
    case ESP_RST_EXT:       return "reset externe (bouton)";
    case ESP_RST_SW:        return "redemarrage logiciel";
    case ESP_RST_PANIC:     return "PLANTAGE (panic)";
    case ESP_RST_INT_WDT:   return "chien de garde d interruption";
    case ESP_RST_TASK_WDT:  return "chien de garde de tache";
    case ESP_RST_WDT:       return "chien de garde";
    case ESP_RST_BROWNOUT:  return "BROWNOUT (alimentation)";
    case ESP_RST_DEEPSLEEP: return "reveil de sommeil profond";
    default:                return "inconnue";
  }
}
static uint32_t      s_scanAt     = 0;

// Envoi par morceaux depuis le navigateur (/api/fw).
static esp_ota_handle_t     s_fwHandle = 0;
static const esp_partition_t* s_fwPart = nullptr;
static size_t               s_fwTotal = 0, s_fwGot = 0;
static uint32_t             s_fwReboot = 0;   // 0 = pas de redemarrage arme

static bool pullOta(const String& url, bool fs, String& err) {
  if (!url.startsWith("http://")) { err = "seul http:// est supporte"; return false; }
  const int slash     = url.indexOf('/', 7);
  const String hostp  = (slash < 0) ? url.substring(7) : url.substring(7, slash);
  const String path   = (slash < 0) ? "/" : url.substring(slash);
  const int colon     = hostp.indexOf(':');
  const String host   = (colon < 0) ? hostp : hostp.substring(0, colon);
  const uint16_t port = (colon < 0) ? 80 : (uint16_t)hostp.substring(colon + 1).toInt();

  WiFiClient c;
  if (!c.connect(host.c_str(), port)) { err = "connexion refusee " + hostp; return false; }
  c.print(String("GET ") + path + " HTTP/1.1\r\nHost: " + hostp +
          "\r\nConnection: close\r\nAccept-Encoding: identity\r\n\r\n");

