Vapi27/gottfa-esp32/src/arena_net.cpp
  // Qui est ce mur. Indispensable des qu'il y en a plusieurs : c'est ce qui
  // permet de balayer le reseau et de dire lequel est lequel.
  j += ",\"name\":\"" + s_name + "\"";
  j += ",\"mac\":\""  + s_mac  + "\"";

  // OTA en mode pull : ou en est le telechargement declenche par /api/otapull.
  j += ",\"otast\":\""  + s_pullStatus + "\"";
  j += ",\"otadone\":"  + String(s_pullDone);
  j += ",\"otatot\":"   + String(s_pullTotal);
  j += ",\"fwgot\":"   + String((uint32_t)s_fwGot);
  j += ",\"fwtot\":"   + String((uint32_t)s_fwTotal);
#ifdef ARENA_MATTER
  // A combien de maisons la carte appartient. Si Maison dit "deja dans une autre
  // maison", c'est ce nombre qu'il faut regarder avant de conclure quoi que ce soit.
  j += ",\"fabrics\":" + String((int)arena_matter_fabrics());
  j += ",\"mev\":\"" + String(arena_matter_last_event()) + "\"";
  { char ev[560]; arena_matter_event_log(ev, sizeof(ev));
    j += ",\"mevlog\":\"" + String(ev) + "\""; }
#endif
  // Empreinte de build : les 8 premiers octets du SHA256 de l'ELF. C'est le SEUL
  // champ qui prouve qu'une OTA a bien remplace l'image - l'uptime ne prouve
  // rien (un envoi qui plante redemarre la carte exactement pareil), et un
  // compteur remis a zero au boot non plus.
  {
    const esp_app_desc_t* d = ARENA_APP_DESC();
    char sha[17];
    for (int i = 0; i < 8; i++) sprintf(sha + i * 2, "%02x", d->app_elf_sha256[i]);
    sha[16] = 0;
    j += ",\"build\":\"" + String(sha) + "\"";
  }
  j += ",\"ip\":\""   + s_ip + "\",\"net\":\"" + s_mode + "\"";
  j += ",\"staFail\":\"" + s_staReason + "\"";
  j += ",\"reset\":\"" + s_reset + "\",\"boots\":" + String(s_boots);
  j += ",\"brownouts\":" + String(s_brownouts);
  j += ",\"txpwr\":" + String(s_txq / 4.0f, 2);
  j += ",\"txDerated\":" + String(s_txDerated ? 1 : 0);
  j += ",\"flashMb\":" + String(s_flashPhys >> 20);
  j += ",\"partMb\":"  + String(s_partEnd >> 20);
  j += ",\"flashBad\":" + String(s_flashBad ? 1 : 0);
  j += ",\"statusLed\":" + String(s_statOn ? 1 : 0);
  j += ",\"statusBright\":" + String(s_statBright);
  // La page doit savoir QUI possede le reseau. Sous Matter, l'appairage apporte
  // les identifiants et il n'y a rien a saisir ; sans Matter, la saisie est le
  // SEUL moyen de rejoindre un reseau. Afficher le discours Matter dans une
  // image qui n'en a pas, c'est dire au proprietaire qu'il n'a rien a faire
  // pendant qu'on lui retire le seul geste qui marche.
#ifdef ARENA_MATTER
  j += ",\"matter\":1";
#else
  j += ",\"matter\":0";
#endif
  j += ",\"up\":"     + String(millis() / 1000);
  j += ",\"heap\":"   + String(ESP.getFreeHeap());
  j += "}";
  return j;
}

// Verrou de niveaux : l'un bouge, l'autre suit. On conserve le RAPPORT et non
// l'ecart, parce que c'est le rapport qu'on percoit comme "le meme equilibre"
// quand on monte ou descend l'ensemble. Le rapport n'est pas defini quand la
// source part de zero : dans ce seul cas on reporte l'ECART, faute de quoi un
// fond descendu a 0 y resterait pour toujours et le verrou aurait l'air casse.
static uint8_t param8(AsyncWebServerRequest* r, const char* k, uint8_t cur) {
  if (!r->hasParam(k)) return cur;
  long v = r->getParam(k)->value().toInt();
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  return (uint8_t)v;
}

static void startServer() {
  // --- UI ---------------------------------------------------------------
  s_server.on("/", HTTP_GET, [](AsyncWebServerRequest* r) {
    // La page vit DANS LE FIRMWARE, pas sur le systeme de fichiers.
    //
    // Elle y etait, et mettre a jour l'interface passait donc par un OTA du
    // systeme de fichiers - or U_SPIFFS reecrit la partition ENTIERE. Le client
    // y perdait sa photo de plateau, son son d'attract et le plan de sa machine :
    // tout ce qu'il avait passe une soiree a poser. C'est le meme mecanisme qui
    // avait efface ses groupes deux fois, avant qu'ils ne passent en NVS.
    //
    // Embarquee, elle se met a jour avec le firmware, qui ne touche pas a
    // LittleFS. La partition de fichiers ne contient plus que ce qui appartient
    // au client. Et il n'y a plus qu'UNE mise a jour a faire au lieu de deux.
    //
    // Un /arena.html.gz present sur LittleFS reste prioritaire : c'est ce qui
    // permet d'essayer une interface modifiee sans reflasher, et c'est aussi la
    // porte de sortie si la page embarquee se revelait cassee.
    if (LittleFS.exists("/arena.html.gz")) {
      AsyncWebServerResponse* rsp = r->beginResponse(LittleFS, "/arena.html.gz", "text/html");
      rsp->addHeader("Content-Encoding", "gzip");
      r->send(rsp);
      return;
    }
    if (LittleFS.exists("/arena.html")) { r->send(LittleFS, "/arena.html", "text/html"); return; }
    AsyncWebServerResponse* rsp =
      r->beginResponse_P(200, "text/html", WEB_PAGE_GZ, WEB_PAGE_GZ_LEN);
    rsp->addHeader("Content-Encoding", "gzip");
    r->send(rsp);
  });

  // --- Son d'attract -------------------------------------------------------
  //
  // Le fichier est joue par le NAVIGATEUR, pas par la carte : le mur n'a ni
  // amplificateur ni haut-parleur, et l'ESP32 a mieux a faire que decoder un
  // MP3 pendant qu'il pousse des trames - toute la correction du pilote RMT
  // consiste justement a ne rien laisser preempter la sortie.
  //
  // La source est laissee ouverte a dessein. Capturer le son de la ROM sous
  // PinMAME ne marche pas avec cette bibliotheque : le rappel audio est bien
  // appele mais toujours avec 0 echantillon, meme en declenchant des sons a la
  // main (mixer_samples_this_frame() rend 0, le mixeur n'a jamais demarre).
  // Un enregistrement de la vraie machine est de toute facon plus fidele qu'une
  // emulation.
  s_server.on("/api/sound", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!LittleFS.exists("/attract.mp3")) { r->send(404, "text/plain", "aucun son"); return; }
    AsyncWebServerResponse* rsp = r->beginResponse(LittleFS, "/attract.mp3", "audio/mpeg");
    r->send(rsp);
  });

  s_server.on("/api/sound", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      size_t sz = 0;
      if (LittleFS.exists("/attract.mp3")) { File f = LittleFS.open("/attract.mp3", "r"); sz = f.size(); f.close(); }
      r->send(sz ? 200 : 400, "text/plain", sz ? "son enregistre" : "rien recu");
    },
    nullptr,
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      static File up;
      static bool full = false;
      if (index == 0) {
        full = false;
        // Refuser AVANT d'ecrire : remplir LittleFS a ras bord rend la carte
        // inflashable par OTA fs, ce qui coute bien plus cher qu'un son absent.
        const size_t libre = LittleFS.totalBytes() - LittleFS.usedBytes();
        if (total + 32768 > libre) {
          full = true;
          Serial.printf("[son] refuse : %u octets pour %u libres\n",
                        (unsigned)total, (unsigned)libre);
          return;
        }
        up = LittleFS.open("/attract.mp3", "w");
        Serial.printf("[son] entrant, %u octets\n", (unsigned)total);
      }
      if (full) return;
      if (up) up.write(data, len);
      if (up && index + len >= total) { up.close(); Serial.println("[son] enregistre"); }
    });

