Vapi27/gottfa-esp32/src/arena_net.cpp
  s_server.on("/api/sound", HTTP_DELETE, [](AsyncWebServerRequest* r) {
    LittleFS.remove("/attract.mp3");
    r->send(200, "text/plain", "son retire");
  });

  s_server.on("/api/pfimg", HTTP_DELETE, [](AsyncWebServerRequest* r) {
    LittleFS.remove("/pf.jpg");
    r->send(200, "text/plain", "photo retiree - retour au plateau livre");
  });

  // Poser, deplacer, retirer un point sur la photo. C'est le geste qui rend le
  // mur possible pour une machine que le depot ne connait pas : pas de table
  // Visual Pinball, pas de ROM, juste une photo et quelqu'un qui sait ou sont
  // ses inserts.
  //   /api/insert/add?x=0.42&y=0.71&n=pop-gauche
  //   /api/insert/move?i=12&x=0.44&y=0.70
  //   /api/insert/del?i=12
  s_server.on("/api/insert/add", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("x") || !r->hasParam("y")) { r->send(400, "text/plain", "x= et y= (0..1) requis"); return; }
    const int i = arenapf::addInsert(r->getParam("x")->value().toFloat(),
                                     r->getParam("y")->value().toFloat(),
                                     r->hasParam("n") ? r->getParam("n")->value().c_str() : nullptr);
    if (i < 0) { r->send(400, "text/plain", "table pleine"); return; }
    arenapf::saveInserts();
    r->send(200, "application/json", "{\"insert\":" + String(i) + "}");
  });
  s_server.on("/api/insert/move", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("i") || !r->hasParam("x") || !r->hasParam("y")) {
      r->send(400, "text/plain", "i=, x= et y= requis"); return;
    }
    if (!arenapf::moveInsert((uint8_t)r->getParam("i")->value().toInt(),
                             r->getParam("x")->value().toFloat(),
                             r->getParam("y")->value().toFloat())) {
      r->send(400, "text/plain", "point inconnu"); return;
    }
    arenapf::saveInserts();
    r->send(200, "text/plain", "deplace");
  });
  s_server.on("/api/insert/del", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("i")) { r->send(400, "text/plain", "i= requis"); return; }
    if (!arenapf::removeInsert((uint8_t)r->getParam("i")->value().toInt())) {
      r->send(400, "text/plain", "point inconnu"); return;
    }
    arenapf::saveInserts();
    arenapf::save();                 // les affectations ont ete recalees
    r->send(200, "text/plain", "retire");
  });

  s_server.on("/api/pixel", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (!r->hasParam("led")) { r->send(400, "text/plain", "led= requis"); return; }
    const long led = r->getParam("led")->value().toInt();
    if (led < 0 || led >= LED_MAX) { r->send(400, "text/plain", "led hors chaine"); return; }

    if (r->hasParam("trim")) {
      long v = r->getParam("trim")->value().toInt();
      if (v < 0)   v = 0;
      if (v > 255) v = 255;
      arenapf::setTrim((uint16_t)led, (uint8_t)v);
      arenapf::saveTrims();
    }

    const uint8_t ins = arenapf::ledInsert((uint16_t)led);
    if (r->hasParam("r") || r->hasParam("g") || r->hasParam("b") || r->hasParam("w")) {
      if (ins == arenapf::UNASSIGNED) {
        r->send(409, "text/plain",
                "ce pixel n'est pose sur aucun insert : la teinte est une propriete "
                "de l'insert (le plastique), pas du fil. Placer le pixel d'abord "
                "(assistant de cartographie), puis recommencer.");
        return;
      }
      arenapf::Colour c = arenapf::colourOf(ins);
      if (r->hasParam("r")) c.r = (uint8_t)r->getParam("r")->value().toInt();
      if (r->hasParam("g")) c.g = (uint8_t)r->getParam("g")->value().toInt();
      if (r->hasParam("b")) c.b = (uint8_t)r->getParam("b")->value().toInt();
      if (r->hasParam("w")) c.w = (uint8_t)r->getParam("w")->value().toInt();
      arenapf::setColour(ins, c);
      arenapf::saveColours();
    }

    const arenapf::Colour c = arenapf::colourOfLed((uint16_t)led);
    String j = "{\"led\":" + String(led);
    j += ",\"trim\":" + String(arenapf::trimOf((uint16_t)led));
    j += ",\"insert\":" + String(ins == arenapf::UNASSIGNED ? -1 : (int)ins);
    j += ",\"zone\":"   + String(arenamap::zoneOfLed((uint16_t)led));
    j += ",\"r\":" + String(c.r) + ",\"g\":" + String(c.g) +
         ",\"b\":" + String(c.b) + ",\"w\":" + String(c.w) + "}";
    r->send(200, "application/json", j);
  });

  s_server.on("/api/pixel/trims", HTTP_GET, [](AsyncWebServerRequest* r) {
    if (r->hasParam("clear")) { arenapf::clearTrims(); arenapf::saveTrims(); }
    r->send(200, "application/json", arenapf::trimsJson());
  });

  s_server.on("/api/zones", HTTP_GET, [](AsyncWebServerRequest* r) {
    r->send(200, "application/json", arenamap::toJson());
  });

  //  POST /api/zones with the same JSON shape -> replace + persist the insert map.
  s_server.on("/api/zones", HTTP_POST,
    [](AsyncWebServerRequest* r) {
      String* body = (String*)r->_tempObject;
      // No body at all is almost never malformed JSON — it is the wrong content
      // type. ESPAsyncWebServer swallows application/x-www-form-urlencoded and
      // multipart into request params and never calls the body handler, so
      // `curl -d` silently arrives here empty while the browser's fetch (which
      // sends text/plain) works. Say which of the two failures this is.
      if (!body) {
        r->send(400, "text/plain",
                "empty body - send the JSON raw, not form-encoded "
                "(curl: --data-binary + -H 'Content-Type: application/json')");
        return;
      }
      bool ok = arenamap::fromJson(body->c_str());
      if (ok) ok = arenamap::save();
      delete body; r->_tempObject = nullptr;
      r->send(ok ? 200 : 400, "text/plain", ok ? "map saved" : "bad map json");
    },
    nullptr,
    [](AsyncWebServerRequest* r, uint8_t* data, size_t len, size_t index, size_t total) {
      if (index == 0) {
        if (r->_tempObject) delete (String*)r->_tempObject;
        String* b = new String();
        b->reserve(total + 1);
        r->_tempObject = b;
      }
      String* body = (String*)r->_tempObject;
      if (body) for (size_t i = 0; i < len; i++) body->concat((char)data[i]);
    });

